controllers/InvoiceItemsController.php

    protected function findModel($id_item)
    {
        if (($model = InvoiceItems::findOne(['id_item' => $id_item])) !== null) {
---
SELECT * FROM `invoice_items` WHERE `id_item`='1'